{"modelTopology":{"class_name":"Model","config":{"name":"model31","layers":[{"name":"input16","class_name":"InputLayer","config":{"batch_input_shape":[null,10,8,5],"dtype":"float32","sparse":false,"name":"input16"},"inbound_nodes":[]},{"name":"flatten_Flatten16","class_name":"Flatten","config":{"name":"flatten_Flatten16","trainable":true},"inbound_nodes":[[["input16",0,0,{}]]]},{"name":"dense_Dense91","class_name":"Dense","config":{"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense91","trainable":true},"inbound_nodes":[[["flatten_Flatten16",0,0,{}]]]},{"name":"dense_Dense92","class_name":"Dense","config":{"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense92","trainable":true},"inbound_nodes":[[["dense_Dense91",0,0,{}]]]},{"name":"dense_Dense93","class_name":"Dense","config":{"units":4,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense93","trainable":true},"inbound_nodes":[[["dense_Dense92",0,0,{}]]]}],"input_layers":[["input16",0,0]],"output_layers":[["dense_Dense93",0,0]]},"keras_version":"tfjs-layers 2.8.6","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense91/kernel","shape":[400,64],"dtype":"float32"},{"name":"dense_Dense91/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense92/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_Dense92/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense93/kernel","shape":[64,4],"dtype":"float32"},{"name":"dense_Dense93/bias","shape":[4],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.8.6","convertedBy":null}