{"modelTopology":{"class_name":"Model","config":{"name":"model32","layers":[{"name":"input16","class_name":"InputLayer","config":{"batch_input_shape":[null,10,8,5],"dtype":"float32","sparse":false,"name":"input16"},"inbound_nodes":[]},{"name":"flatten_Flatten16","class_name":"Flatten","config":{"name":"flatten_Flatten16","trainable":true},"inbound_nodes":[[["input16",0,0,{}]]]},{"name":"dense_Dense94","class_name":"Dense","config":{"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense94","trainable":true},"inbound_nodes":[[["flatten_Flatten16",0,0,{}]]]},{"name":"dense_Dense95","class_name":"Dense","config":{"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense95","trainable":true},"inbound_nodes":[[["dense_Dense94",0,0,{}]]]},{"name":"dense_Dense96","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense96","trainable":true},"inbound_nodes":[[["dense_Dense95",0,0,{}]]]}],"input_layers":[["input16",0,0]],"output_layers":[["dense_Dense96",0,0]]},"keras_version":"tfjs-layers 2.8.6","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense94/kernel","shape":[400,64],"dtype":"float32"},{"name":"dense_Dense94/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense95/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_Dense95/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense96/kernel","shape":[64,1],"dtype":"float32"},{"name":"dense_Dense96/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.8.6","convertedBy":null}